Tekla Open API Reference for Tekla Structures 2025
Operation.Combine Method
Overload List
Name | Description
Combine(Beam, Beam)
 Combines two beams into one beam.
Combine(RebarGroup, RebarGroup)
 Combines two rebar groups into one rebar group.
Combine(SingleRebar, SingleRebar)
 Combines two single rebars into one rebar.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace